#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Created on Sat Jan  5 15:15:16 2019

@author: linge
"""

# 导入爬虫所需package
import urllib.request  
import re
import os
import requests
import csv

courts = ['滨江新苑', '滨江家园', '龙生钱塘名都', '在水一方公寓', '钱江苑', '未央村', 
          '平海公寓', '长生路社区', '向阳新村', '浣纱路小区', '邮电路小区', '城南家园', 
          '金都华府', '候潮公寓', '南星公寓', '江枫苑', '北落马营', '望江家园西园', 
          '望江家园东园', '近江二园', '近江九园', '近江一园', '近江八园', '近江七园', 
          '近江四园', '近江六园', '婺江家园二园', '近江三园', '近江五园', '春江花月', 
          '凤凰北苑', '新工社区', '凤凰南苑', '秋涛南苑', '木材新村', '艮园', '东园', 
          '环东公寓', '春丰苑', '漾河公寓', '水印康庭', '东新园新湖苑', '东新园', 
          '东新园雪峰苑', '东新园茗盛苑', '东新园望景苑', '东新园孚信苑', '皇亲苑', 
          '竹竿巷社区', '国都公寓', '麒麟街小区', '仙林苑', '孩儿巷小区', '平安居', 
          '大和弄', '玄坛公寓', '绿洲花园', '现代名苑', '现代雅苑', '现代景苑', '现代家园', 
          '五里塘苑', '朝晖四区', '朝晖二区', '朝晖六区', '朝晖新城', '潮王公寓', '环西新村', 
          '直戒坛寺巷', '西子铭苑', '戒坛寺巷', '灯芯巷社区', '安吉路小区', '北景园月桂苑', 
          '北景园芳洲苑', '北景园水镜苑', '北景园紫荆苑', '北景园菊香苑', '北景园竹邻苑', 
          '莫干新村', '锦绣新村', '沈塘铭苑', '稻香园南区', '米市巷小区', '维元弄', 
          '红石中央花苑', '昆仑公馆', '锦昌文华苑', '中庆紫荆家园', '绿城江南里', 
          '南北西岸', '运河宸园', '德信臻园', '大河宸章', '银树湾', '名城公馆', 
          '风景大院', '城市风景', '九龙仓碧玺', '新安天苑', '锦绣文澜阁', '吉如家园',
          '娑婆新村', '董家新村', '董家弄', '协安景上', '蚕花园永安坊', '蚕花园永庆坊', 
          '蚕花园永兴坊', '蚕花园永宁坊', '定海东园', '金都清宸公寓', '定海西园',
          '蚕花园永和坊', '左岸花园', '大关南六苑', '大关南九苑', '大关南四苑', '大关南三苑',
          '香吉公寓', '大关南七苑', '大关南二苑', '大关南八苑', '大关南五苑', '大关东二苑', 
          '大关东七苑', '大关东一苑', '大关东九苑', '大关东八苑', '大关东四苑', '双菱新村', 
          '采荷芙蓉', '采荷紫藕', '采荷翠柳', '红菱新村', '采荷洁莲', '采荷金谷', '夕照新村',
          '凯旋苑', '商教苑', '凯旋新村', '采荷玉荷', '金牛坊', '采荷青荷苑', '采荷青莼', 
          '清泰小区', '采荷路35号', '茶厂宿舍', '海棠公寓', '罗兰春天', '天阳九筑', 
          '九润公寓', '魅力之城', '汇盛德堡', '多立方', '景芳二区', '景芳三区', '金都城市芯宇', 
          '梧桐公寓', '花园南村', '御西湖', '花园北村', '枫华府第', '花园西村', '春江时代', '师苑新村', '今日嘉园', '中豪晴园', '里东山弄', '外东山弄', '曙光路小区', '浙大新村', '栖霞岭', '曙光公寓', '仁寿山', '曙光三弄', '桃园新村', '黄龙雅苑', '松木场河东', '武林花园', '绿园', '胜利新村', '金祝新村', '松溪公寓', '启真名苑', '锦绣文苑', '窑背巷', '友谊新村', '罗马公寓', '西溪路小区', '杭大新村', '文二新村', '中大文锦苑', '崇文公寓', '下宁巷', '西溪河东', '马塍路小区', '日晖新村', '沈塘新村', '世贸丽晶城', '邮电新村', '马塍路11号', '文三新村', '武林门新村', '上宁新村', '圣苑', '文鼎苑', '冠苑小区', '中兴公寓', '香樟公寓', '南都德迦西区', '金都新城', '紫金公寓', '康乐新村', '科技新村', '南都德迦东区', '美都新村', '雅仕苑', '金成花园', '恩济花苑', '东海名仕家园', '紫桂花园', '兰桂花园', '求是新村', '曙光新村', '玉古路小区', '嘉绿青苑', '嘉绿莲苑', '世纪新城', '嘉绿西苑', '嘉绿文苑', '嘉绿名苑', '南都银座公寓', '嘉绿北苑', '毛家桥公寓', '富丽苑', '嘉绿苑南', '星洲花园', '新金都城市花园', '高教新村', '桂花城', '阳光地带', '紫荆欣苑', '华苑公寓', '嘉南公寓', '香墅', '梅苑阁小区', '新德雅公寓', '溪畔花园', '石灰桥新村', '白荡海人家', '华海园', '兰庭国际', '银马公寓', '建工新村', '兴财名都苑', '西溪公寓', '天元西溪锋尚', '嘉绿景苑', '银桂花园', '颐景园文新', '金田花园', '金都花园', '云桂花园', '府新花园', '世纪西溪别墅', '丹枫新村', '省规划局宿舍', '政苑小区', '紫金文苑', '协安上郡', '拱苑小区', '府苑新村', '新帝朗郡', '绿城之江1号', '新西湖花园', '绿城云栖玫瑰园', '阳明谷', '采荷东区', '采荷人家', '闸弄口新村', '紫薇公寓', '天成嘉苑', '京惠花园', '新安铭苑', '闸弄口东村', '天成铭园', '机神公寓', '闸弄口铁路宿舍', '新和嘉苑', '采荷紫园', '人民社区', '都市水乡水秀苑', '润达花园', '都市水乡水月苑', '秀月家园', '新世纪花苑', '美都公寓', '和家园', '坤和求是里', '协安紫郡', '中海紫藤苑', '同仁家园', '东方花城', '滨康小区', '水晶湾', '温兴风情苑', '滨康二苑', '官河锦庭', '滨安小区', '河畔花园', '兴盛花园', '连园', '铁岭花园', '同方燕语林森', '官河公寓', '风雅钱塘', '倾城之恋', '明月江南', '温馨人家', '东方郡', '迎春北苑', '江南豪园', '钱塘春晓', '中央花城', '迎春小区', '铂金时代', '新州花苑', '望江南', '太阳国际', '盛元慧谷', '水晶城', '钱塘帝景', '国信嘉园', '钱江水晶澜轩', '仁苑', '滨江江滨花园', '南岸晶都', '风景蝶院', '长兴苑', '铂金名筑', '朗庭公馆', '江南铭庭', '湖漫雅筑', '曼城', '星汇荣邸', '金盛浦沿公寓', '新浦苑', '浮力森林苑', '中兴和园', '火炬小区', '春波小区', '滨兴小区东区', '江虹小区', '滨兴西苑', '滨兴北苑小区', '金沙学府', '金沙居', '清雅苑', '江语海', '云水苑', '江语海排屋', '阳光华城', '嘉里桦枫居', '元都新景公寓', '亿城嘉园', '元都新苑', '华润翠庭', '亿城雅苑', '长江小区', '长江西苑', '欣盛东方福邸', '万家花城', '橡树园', '景瑞申花壹号院', '赛丽绿城慧园', '景瑞悦西台', '方家花苑', '保利香槟国际']

headers = { "Accept":"text/html,application/xhtml+xml,application/xml;",
            "Accept-Encoding":"gzip",
            "Accept-Language":"zh-CN,zh;q=0.8",
            "Referer":"http://www.example.com/",
            "User-Agent":"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/42.0.2311.90 Safari/537.36" }

f = open('fee1.txt', 'r')

d = {}

for line in f.readlines():
    line = line.replace('\n','').split(" ")
    d[line[0]] = line[-1]

target_url = "https://hz.lianjia.com/xiaoqu/rs/"
# 爬取小区数据
with open("fee.csv", "w") as csvfile:
    writer =  csv.writer(csvfile)
    
    results = []
    
    writer.writerow(["小区名称","物业费(元/平米/月)"])
    
    #court = '北景园月桂苑'
    
    for court in courts:
        if court in d:
            continue
        result = []
        response = requests.get(target_url + court + '/',headers=headers)
        response.encoding = 'utf8'
        html_reg = r'共找到<span>(.*?)</span>个小区'
        html = re.findall(html_reg, response.text, re.S|re.M)
        if html[0][1] == '1':
            next_reg = r'<!-- 左侧内容 -->.*?<div class="info">.*?<div class="title">.*?<a href="(.*?)" target="_blank">' + court + '</a>'
            next_page = re.findall(next_reg, response.text, re.S|re.M)
            if len(next_page) == 0:
                print('未找到小区页   ' + court)
                continue
            fee_reg = r'<span class="xiaoquInfoLabel">物业费用</span><span class="xiaoquInfoContent">(.*?)元/平米/月</span>'
            response_fee = requests.get(next_page[0], headers=headers)
            response_fee.encoding = 'utf8'
            fee = re.findall(fee_reg, response_fee.text, re.S|re.M)
            if len(fee) != 1:
                print('爬取' + court + '  ' + next_page[0] + '出错')
                continue
            result.append(court)
            if fee[0].find('至') != -1:
                a, b = float(fee[0].split('至')[0]), float(fee[0].split('至')[1])
                result.append((a + b) / 2)
            else:
                result.append(fee[0])
            writer.writerow(result)
            print(court + '  ' + '完成')
        elif html[0][1] == '0':
            print('未找到小区   ' + court )
        else:
            print(html[0] + '  ' + court)
    